In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in c:\users\peep1\anaconda3\envs\env_django\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\peep1\anaconda3\envs\env_django\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\peep1\anaconda3\envs\env_django\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   -------- ------------------------------- 2.4/11.6 MB 11.2 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.6 MB 11.9 MB/s eta 0:00:01
   ------------------------- -------------- 7.3/11.6 MB 11.6 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.6 MB 11.6 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 11.5 MB/s eta 0:00:00
Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.1 tzdata-2025.1
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

s = pd.Series([10, 20, 30])
print(s)

s = pd.Series(['고가','시가'])
print(s)

0    10
1    20
2    30
dtype: int64
0    고가
1    시가
dtype: object

In [3]:
s = pd.Series(['삼성', 80000])
print(s)

0       삼성
1    80000
dtype: object

In [5]:
# 인덱스
s = pd.Series([1000, 2000, 3000])
print(s)

print(s.index)
print(s.values)
print(s.index.to_list())

0    1000
1    2000
2    3000
dtype: int64
RangeIndex(start=0, stop=3, step=1)
[1000 2000 3000]
[0, 1, 2]

In [9]:
# 인덱스 수정
s = pd.Series([1000, 2000, 3000])
s.index = ['메로나', '구구콘', '하겐다즈']

print(s)
print(s.index)
print(s.values)
print(s.index.to_list())

ss = pd.Series([1000, 2000, 3000], ['메로나', '구구콘', '하겐다즈'])
print(ss)

sss = pd.Series(index = [1000, 2000, 3000], data = ['메로나', '구구콘', '하겐다즈']) # 위치기반 말고 키워드로도 가능
print(sss)

메로나     1000
구구콘     2000
하겐다즈    3000
dtype: object
Index(['메로나', '구구콘', '하겐다즈'], dtype='object')
[1000 2000 '3000']
['메로나', '구구콘', '하겐다즈']
메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64
1000     메로나
2000     구구콘
3000    하겐다즈
dtype: object

In [11]:
data = {
    "2019-05-31" : 42500,
    "2019-05-30" : 42550,
    "2019-05-29" : 41800,
    "2019-05-28" : 42550,
    "2019-05-27" : 42650
}

s_samsung = pd.Series(data)
print(s_samsung)
print(s_samsung.values) # 넘파이
print(s_samsung.index.to_list()) # list

2019-05-31    42500
2019-05-30    42550
2019-05-29    41800
2019-05-28    42550
2019-05-27    42650
dtype: int64
[42500 42550 41800 42550 42650]
['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

In [2]:
import pandas as pd
# read 인덱싱
s = pd.Series([1000, 2000, 3000], ['메로나', '구구콘', '하겐다즈']) # 인덱스는 데이터 타입이 같을 필요가 없다. ['메로나', '구구콘', -1]

print(s.iloc[0])
print(s.iloc[1])
print(s.iloc[2])
print(s.iloc[-1])

# 인덱스 이름으로 검색
print(s.loc['메로나'])
print(s.loc['구구콘'])
print(s.loc['하겐다즈'])
# print(s.loc[-1]) 얘는 오류난다

IndentationError: unexpected indent (4116205467.py, line 14)

In [3]:
# read 슬라이싱
s = pd.Series([1000, 2000, 3000], ['메로나', '구구콘', '하겐다즈'])

print(s.iloc[0 : 2])

# 슬라이싱으로 끌고 오면 -> 시리즈 객체로 리턴이 된다.
print(s.loc['메로나' : '구구콘'])

indice = [0, 2]
print(s.iloc[indice])

메로나    1000
구구콘    2000
dtype: int64
메로나    1000
구구콘    2000
dtype: int64
메로나     1000
하겐다즈    3000
dtype: int64

In [2]:
# 수정 추가 삭제
from pandas import Series

data = [1000, 2000, 3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data=data, index=index)

s.loc['메로나'] = 500 # 인덱스로 접근
print(s)

s.iloc[0] = 1000 # 행 번호로 접근
print(s)

메로나      500
구구콘     2000
하겐다즈    3000
dtype: int64
메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [3]:
from pandas import Series

data = [1000, 2000, 3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data=data, index=index)

# 추가는 딕셔너리처럼 동적으로 가능하다.
s.loc['비비빅'] = 500
print(s)

메로나     1000
구구콘     2000
하겐다즈    3000
비비빅      500
dtype: int64

In [9]:
from pandas import Series

data = [1000, 2000, 3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data=data, index=index)

print(s.drop('메로나')) # 옵션을 주지 않게 되면 원본은 지우지 않고, 지운 값만 리턴한다.
print(s)

t = s.drop('메로나')
print(t)
print(s)

구구콘     2000
하겐다즈    3000
dtype: int64
메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64
구구콘     2000
하겐다즈    3000
dtype: int64
메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [10]:
from pandas import Series

data = [1000, 2000, 3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data=data, index=index)

s.drop('메로나', inplace=True)
print(s)

구구콘     2000
하겐다즈    3000
dtype: int64

In [14]:
# 시리즈 연산
# 넘파이와 동일하게 브로드캐스팅이 적용되며, 같은 인덱스를 갖는 데이터끼리 연산을 수행한다.
import pandas as pd

# 인덱스 순서가 다르다.
s_1 = pd.Series([10, 20, 30], index = ['NAVER', 'SKT', 'KT'])
s_2 = pd.Series([20, 30, 10], index = ['SKT', 'KT', 'NAVER'])

# 동일한 인덱스끼리 연산되었다.
s_3 = s_1 + s_2
print(s_3)

s_3 = s_1 - s_2
print(s_3)

KT       60
NAVER    20
SKT      40
dtype: int64
KT       0
NAVER    0
SKT      0
dtype: int64

In [13]:
# 브로드캐스팅
import pandas as pd

s_1 = pd.Series([10, 20, 30], index = ['NAVER', 'SKT', 'KT'])
s_2 = pd.Series([20, 30, 10], index = ['SKT', 'KT', 'NAVER'])

print(10 * s_1)

NAVER    100
SKT      200
KT       300
dtype: int64

In [22]:
# 삼성전자 5일 주가
import pandas as pd

high = pd.Series([42800, 42700, 42050, 42950, 43000])
low = pd.Series([42150, 42150, 41300, 42150, 42350])

s_diff = high - low
print(s_diff)

s_diff.max()
s_diff.min()

s_diff.mean() # 평균
s_diff.median() # 중간값
s_diff.var() # 분산
s_diff.std() # 표준편차

s_diff.cumprod() # 누적곱

0    650
1    550
2    750
3    800
4    650
dtype: int64

0                650
1             357500
2          268125000
3       214500000000
4    139425000000000
dtype: int64

In [25]:
import pandas as pd

data = {
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차": "운수장비",
    "NAVER": "서비스업",
    "카카오": "서비스업"
}
s = pd.Series(data)

print(s.unique()) # 넘파이로 리턴해준다
print(type(s.unique()))

s.value_counts() # 시리즈로 리턴

['전기,전자' '운수장비' '서비스업']
<class 'numpy.ndarray'>

전기,전자    2
서비스업     2
운수장비     1
Name: count, dtype: int64

In [28]:
# 시리즈 Map
# 시리즈를 사용하다 보면 시리즈가 지원하는 기본연산 의외에도
# 복잡한 형태의 사용자 정의 코드를 적용하고 싶은 경우

s = pd.Series(['1,234', '5,678', '9,876'])

# print(int(s)) 컴마인데 당연히 안된다.

def remove_comma(x):
    print(x, "in function")
    return int(x.replace(',', ''))

result = s.map(remove_comma) # 시리즈 클래스에서 제공해주는 맵핑 함수
print(result)

print(result.sum())

1,234 in function
5,678 in function
9,876 in function
0    1234
1    5678
2    9876
dtype: int64
16788

In [29]:
s = pd.Series([1234, 5678, 9876])

def size_check(x):
    if x > 5000:
        return "크다"
    else:
        return "작다"
    
s = s.map(size_check)
print(s)

0    작다
1    크다
2    크다
dtype: object

In [31]:
# 시리즈 필터링

data = [42500, 42550, 41800, 42550, 42650]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

s = pd.Series(data=data, index=index)

cond = s > 42000 # ????? 미쳐버린 오버로딩...
print(cond)
print(s[cond]) # True만 출력한다

2019-05-31     True
2019-05-30     True
2019-05-29    False
2019-05-28     True
2019-05-27     True
dtype: bool
2019-05-31    42500
2019-05-30    42550
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [34]:
close = [42500, 42550, 41800, 42550, 42650]
open = [42600, 42200, 41850, 42550, 42500]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

open = Series(data=open, index=index)
close = Series(data=close, index=index)

# 종가가 시가보다 높을때만 출력
cond = close > open
print(s[cond])

2019-05-30    42550
2019-05-27    42650
dtype: int64

In [40]:
import pandas as pd

open = [42600, 42200, 41850, 42550, 42500]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

open = Series(data=open, index=index)

print(dir(open))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__column_consortium_standard__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_attrs', '_binop', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_expanddim_from_mgr', '_constructor_from_mgr', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_duplicated', '_find_valid_index', '_flags', '_flex_method', '_from_mgr', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_index_resolvers', '_get_label_or_level_values', '_get_numeric_data', '_get_rows_with_mask', '_get_value', '_get_values_tuple', '_get_with', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_item_cache', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_update_cacher', '_memory_usage', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_references', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_shift_with_freq', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'case_when', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'interpolate', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'list', 'loc', 'lt', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'std', 'struct', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [43]:
# 정렬 및 순위

data = [3.1, 2.0, 10.1, 5.1]
index = ['000010', '000020', '000030', '000040']
s = pd.Series(data=data, index=index)

# 정렬
s1 = s.sort_values() # 내림차순은 s.sort_values(ascending=False) 파라미터 주면 된다.
print(s1)

s2 = s.sort_index()
print(s2)

000020     2.0
000010     3.1
000040     5.1
000030    10.1
dtype: float64
000010     3.1
000020     2.0
000030    10.1
000040     5.1
dtype: float64

In [45]:
#순위
data = [3.1, 2.0, 10.1, 3.1]
index = ['000010', '000020', '000030', '000040']
s = pd.Series(data=data, index=index)

print(s.rank()) # 작은 순자순으로 랭크. float64로 저장된다.
print(s.rank(ascending=False)) # 높은 숫자 순으로.

000010    2.5
000020    1.0
000030    4.0
000040    2.5
dtype: float64
000010    2.5
000020    4.0
000030    1.0
000040    2.5
dtype: float64

In [49]:
# 데이터프레임
# 컬럼 단위로 데이터 표현
data = { # 딕셔너리
    '시가' : [30, 90, 80],
    '고가' : [40, 70, 90],
    '저가' : [20, 60, 80],
    '종가' : [90, 80, 80]
}
index = ['삼성전자', '카카오', '네이버']

stock_df = pd.DataFrame(data) # df_stock 이런 식으로도 이름 짓는다. df 가 꼭 들어간다.
print(stock_df)

df_stock = pd.DataFrame(data = data, index = index)
print(df_stock)

   시가  고가  저가  종가
0  30  40  20  90
1  90  70  60  80
2  80  90  80  80
      시가  고가  저가  종가
삼성전자  30  40  20  90
카카오   90  70  60  80
네이버   80  90  80  80

In [50]:
# 로우 단위로 데이터 표현
data = [ # 리스트
    [30, 90, 80, 90],
    [30, 90, 80, 90],
    [30, 90, 80, 90]
]
column = ['시가', '고가', '저가', '종가']
index = ['삼성전자', '카카오', '네이버']

df_stock = pd.DataFrame(data = data, columns = column, index = index)
df_stock

      시가  고가  저가  종가
삼성전자  30  90  80  90
카카오   30  90  80  90
네이버   30  90  80  90

In [52]:
# 로우 단위를 딕셔너리로 표현
data2 = [
    {'시가' : 980, '고가' : 80, '저가' : 70, '종가' : 90},
    {'시가' : 880, '고가' : 80, '저가' : 70, '종가' : 90},
    {'시가' : 780, '고가' : 80, '저가' : 70, '종가' : 90}
]
index = ['삼성전자', '카카오', '네이버']

df_stock = pd.DataFrame(data = data2, index = index)
df_stock

       시가  고가  저가  종가
삼성전자  980  80  70  90
카카오   880  80  70  90
네이버   780  80  70  90

In [53]:
import pandas as pd

data = {
    '나이' : [35, 30, 28],
    '직책' : ['과장', '대리', '대리']
}
index = ['김은수', '박정민', '이하나']

df_emp = pd.DataFrame(data = data, index = index)
df_emp

     나이  직책
김은수  35  과장
박정민  30  대리
이하나  28  대리

In [58]:
# 데이터 프레임 전체적인 개괄요약 함수
df_emp.info()

df_emp.describe()
df_emp.shape

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 김은수 to 이하나
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   나이      3 non-null      int64
 1   직책      3 non-null      object
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

(3, 2)

In [64]:
import pandas as pd

# 고객 데이터를 담은 딕셔너리 생성
data = {
    "이름": ["김철수", "이영희", "박민수"],
    "나이": [25, 32, 19],
    "도시": ["서울", "부산", "대구"]
}

# 딕셔너리를 사용해 데이터프레임 생성
df = pd.DataFrame(data)

# 데이터프레임 출력
print(df)

# 도시 열 선택
column_data = df["도시"]
print(column_data) # 시리즈로 리턴된다.

# 도시 이름 두개를 선택
selected_columns = df[['도시', '이름']] # 두개 이상은 리스트 형태로 넣어줘야 한다.
print(selected_columns)
print(type(selected_columns)) # 데이터 프레임으로 리턴

# 행 선택
df.head() # 기본적으로 위에서부터 5개의 행을 뽑아낸다.
df.tail() # 밑에서부터 5개.

df.head(10) # 파라미터에 넣은 값 만큼 출력한다.

# 한 줄 뽑기
row = df.loc[0] # 시리즈 형태로 바뀐다.
print(row)
print(type(row))

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  박민수  19  대구
0    서울
1    부산
2    대구
Name: 도시, dtype: object
   도시   이름
0  서울  김철수
1  부산  이영희
2  대구  박민수
<class 'pandas.core.frame.DataFrame'>
이름    김철수
나이     25
도시     서울
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
import pandas as pd

df = pd.DataFrame( {
    '이름': ['피카츄','라이츄','리자드','리자몽','꼬부기','어니부기'],
    '속성': ['전기', '전기', '불','불','물',None], 
    '색깔': ['노랑', '노랑', None,'빨강','파랑','파랑'],
    '순위': [ 5, 2, 6, 1, 4, 3] })

df.columns = ['이름', '속성','색깔','순위']

df.info()
df.head(6)

# 열 출력
df['속성'] # 시리즈로 리턴
df[ ['속성', '순위'] ] # 데이터 프레임으로 리턴
df[ ['속성'] ] # 데이터 프레임으로 리턴

df['속성'].values # 넘파이로 리턴

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   속성      5 non-null      object
 2   색깔      5 non-null      object
 3   순위      6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

     속성  순위
0    전기   5
1    전기   2
2     불   6
3     불   1
4     물   4
5  None   3

In [9]:
# 행 인덱싱

# 슬라이싱 사용 시 데이터 프레임으로 리턴된다
print(df[1 : 3]) # 2개 이상 행
print(df[3 : 4]) # 단일 행

# 자료 1개만 가져오기
df['색깔'][3]

# 불리언 인덱싱 = if문과 유사
print(df['순위'] < 3)
print(df[df['순위'] < 3])

# 색깔이 노랑인 행을 출력하라
print(df[df['색깔'] == "노랑"])

# 순위가 2보다 크고 5보다 작은 행들을 출력하시오.
print(df[(df['순위'] > 2) & (df['순위'] < 5)])

# 순위가 1이거나 또는 색깔이 노랑
print(df[(df['순위'] == 1) | (df['색깔'] == '노랑')])

    이름  속성    색깔  순위
1  라이츄  전기    노랑   2
2  리자드   불  None   6
    이름 속성  색깔  순위
3  리자몽  불  빨강   1

In [20]:
# null 데이터 가져오기 = 결측치(missing value)
# 파이썬 연산에서 결측치가 있으면 연산이 안될 수 있다.

df.info()
df[df.isnull()]
df[df['속성'].isnull()] # 속성 column에 None 을 가진 row를 전부 출력해준다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   속성      5 non-null      object
 2   색깔      5 non-null      object
 3   순위      6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

     이름    속성  색깔  순위
5  어니부기  None  파랑   3

In [28]:
# loc/iloc로 행 가져오기
df.iloc[0] # 시리즈로 리턴
df.iloc[[0]] # 데이터 프레임으로 리턴
df.iloc[[0, 2, 4]] # 행 번호
df.iloc[2:4] # 슬라이싱 연산 데이터프레임 리턴!

    이름 속성    색깔  순위
2  리자드  불  None   6
3  리자몽  불    빨강   1

In [30]:
# 행과 열 같이 가져오기
print(df.iloc[0, 0]) # 행,열에는 번호 인덱스만 가능.
df.iloc[[1, 3], [0, 2, 3]]
df.iloc[2:5, 1:3]

피카츄

    이름  색깔  순위
1  라이츄  노랑   2
3  리자몽  빨강   1

In [32]:
# loc (라벨로 인덱싱/끝 번호 포함)
import pandas as pd
data = {
    '이름' : ['유재석', '박명수', '정준하', '노홍철', '정형돈', '하하'],
    '지역' : ['서울', '부산', '부산', '서울', '서울', '서울'],
    '나이' : [19, 23, 20, 25, 18, 21],
    '국어점수' : [86, 90, 80, 65, 50, 60],
    '수학점수' : [86, 100, 66, 70, 40, 80],
    '코딩' : ['Python', 'Java', '', 'Javascript', 'PYTHON', '']
}
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번'])
df.index.name = '번호'

df

     이름  지역  나이  국어점수  수학점수          코딩
번호
1번  유재석  서울  19    86    86      Python
2번  박명수  부산  23    90   100        Java
3번  정준하  부산  20    80    66
4번  노홍철  서울  25    65    70  Javascript
5번  정형돈  서울  18    50    40      PYTHON
6번   하하  서울  21    60    80

In [39]:
df.loc['1번'] # 1번 전체 데이터
df.loc['1번', '나이']
df.loc[['1번','2번']]
df.loc[['1번','2번'], '수학점수']
df.loc[['1번','2번'], ['수학점수', '국어점수']]

# loc 슬라이싱
df.loc['1번':'4번', '지역':'국어점수'] # loc와 iloc의 다른점은 라벨로 접근하는것 이며 끝번호를 포함한다.

    지역  나이  국어점수
번호
1번  서울  19    86
2번  부산  23    90
3번  부산  20    80
4번  서울  25    65

In [41]:
df.loc[df['나이'] >= 20, ['이름', '지역', '나이']]

     이름  지역  나이
번호
2번  박명수  부산  23
3번  정준하  부산  20
4번  노홍철  서울  25
6번   하하  서울  21

In [42]:
# 지역이 부산이고 나이가 20세 이상인 표를 만드시오
df.loc[(df['지역'] == '부산') & (df['나이'] >= 20), ['이름', '지역', '나이']]

     이름  지역  나이
번호
2번  박명수  부산  23
3번  정준하  부산  20

In [45]:
# 데이터 프레임 함수

# 유씨 성을 가진 사람 뽑아내기
filter = df['이름'].str.startswith("유")
print(filter)
df[filter]

번호
1번     True
2번    False
3번    False
4번    False
5번    False
6번    False
Name: 이름, dtype: bool

     이름  지역  나이  국어점수  수학점수      코딩
번호
1번  유재석  서울  19    86    86  Python

In [46]:
# 이름에 '하'가 들어가는 사람
filter = df['이름'].str.contains('하')
df[filter]

     이름  지역  나이  국어점수  수학점수 코딩
번호
3번  정준하  부산  20    80    66
6번   하하  서울  21    60    80

In [47]:
filter = df['코딩'].isin(['Python', 'Java'])
df[filter]

     이름  지역  나이  국어점수  수학점수      코딩
번호
1번  유재석  서울  19    86    86  Python
2번  박명수  부산  23    90   100    Java

In [83]:
# 결측치 처리
import pandas as pd
import numpy as np
data = {
    '이름' : ['유재석', '박명수', '정준하', '노홍철', '정형돈', '하하'],
    '지역' : ['서울', '부산', np.nan, '서울', '서울', '서울'],
    '나이' : [19, 23, 20, 25, 18, 21],
    '국어점수' : [86, 90, 80, 65, 50, 60],
    '수학점수' : [86, 100, 66, 70, 40, 80],
    '코딩' : ['Python', 'Java', np.nan, 'Javascript', 'PYTHON', np.nan]
}
# 넘파이 nan 사용하면 Null 처리
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번'])
df.index.name = '번호'

df

     이름   지역  나이  국어점수  수학점수          코딩
번호
1번  유재석   서울  19    86    86      Python
2번  박명수   부산  23    90   100        Java
3번  정준하  NaN  20    80    66         NaN
4번  노홍철   서울  25    65    70  Javascript
5번  정형돈   서울  18    50    40      PYTHON
6번   하하   서울  21    60    80         NaN

In [50]:
# 결측치 지정
df["지역"] = np.nan
df

     이름  지역  나이  국어점수  수학점수          코딩
번호
1번  유재석 NaN  19    86    86      Python
2번  박명수 NaN  23    90   100        Java
3번  정준하 NaN  20    80    66         NaN
4번  노홍철 NaN  25    65    70  Javascript
5번  정형돈 NaN  18    50    40      PYTHON
6번   하하 NaN  21    60    80         NaN

In [51]:
# 결측치 채우기
df.fillna('')

     이름 지역  나이  국어점수  수학점수          코딩
번호
1번  유재석     19    86    86      Python
2번  박명수     23    90   100        Java
3번  정준하     20    80    66
4번  노홍철     25    65    70  Javascript
5번  정형돈     18    50    40      PYTHON
6번   하하     21    60    80

In [52]:
# 특정 열만 채우기
df['코딩'].fillna('확인중') # fillna('', inplace = True) inplace를 하면 원본까지 바꾼다.

번호
1번        Python
2번          Java
3번           확인중
4번    Javascript
5번        PYTHON
6번           확인중
Name: 코딩, dtype: object

In [59]:
# 데이터 제외하기
df.dropna() # 결측치가 있는 데이터를 날린다. 마찬가지로 inplace만 안하면 원본은 남아있다.

     이름  지역  나이  국어점수  수학점수          코딩
번호
1번  유재석  서울  19    86    86      Python
2번  박명수  부산  23    90   100        Java
4번  노홍철  서울  25    65    70  Javascript
5번  정형돈  서울  18    50    40      PYTHON

In [58]:
# 정렬
df.sort_index() # 인덱스 기준으로 정렬.ascending=False를 파라미터로 지정해주면 내림차순

     이름   지역  나이  국어점수  수학점수          코딩
번호
1번  유재석   서울  19    86    86      Python
2번  박명수   부산  23    90   100        Java
3번  정준하  NaN  20    80    66         NaN
4번  노홍철   서울  25    65    70  Javascript
5번  정형돈   서울  18    50    40      PYTHON
6번   하하   서울  21    60    80         NaN

In [61]:
# 컬럼 기준 정렬
df.sort_values(by='나이')

     이름   지역  나이  국어점수  수학점수          코딩
번호
5번  정형돈   서울  18    50    40      PYTHON
1번  유재석   서울  19    86    86      Python
3번  정준하  NaN  20    80    66         NaN
6번   하하   서울  21    60    80         NaN
2번  박명수   부산  23    90   100        Java
4번  노홍철   서울  25    65    70  Javascript

In [63]:
# 두 컬럼을 기준으로 정렬
df.sort_values(['지역', '국어점수'])

# 지역은 오름차순, 국어는 내림차순으로
df.sort_values(['지역', '국어점수'], ascending=[True, False])

     이름   지역  나이  국어점수  수학점수          코딩
번호
2번  박명수   부산  23    90   100        Java
1번  유재석   서울  19    86    86      Python
4번  노홍철   서울  25    65    70  Javascript
6번   하하   서울  21    60    80         NaN
5번  정형돈   서울  18    50    40      PYTHON
3번  정준하  NaN  20    80    66         NaN

In [64]:
# 특정 column을 시리즈로 불러와 정렬
df['수학점수'].sort_values()

번호
5번     40
3번     66
4번     70
6번     80
1번     86
2번    100
Name: 수학점수, dtype: int64

In [71]:
# 함수 적용 - apply
def age_add(age):
    return str(age) + "세"

df['나이'] = df['나이'].apply(age_add)
df

     이름   지역   나이  국어점수  수학점수          코딩
번호
1번  유재석   서울  19세    86    86      Python
2번  박명수   부산  23세    90   100        Java
3번  정준하  NaN  20세    80    66         NaN
4번  노홍철   서울  25세    65    70  Javascript
5번  정형돈   서울  18세    50    40      PYTHON
6번   하하   서울  21세    60    80         NaN

In [73]:
# 데이터 수정
# 컬럼 추가/삭제
df['지역'].replace({'서울':'경기', '부산':'대구'}, inplace=True) # 딕셔너리 형태로 바꾼다
df

     이름   지역   나이  국어점수  수학점수          코딩
번호
1번  유재석   경기  19세    86    86      Python
2번  박명수   대구  23세    90   100        Java
3번  정준하  NaN  20세    80    66         NaN
4번  노홍철   경기  25세    65    70  Javascript
5번  정형돈   경기  18세    50    40      PYTHON
6번   하하   경기  21세    60    80         NaN

In [74]:
df['코딩'] = df['코딩'].str.lower()

In [79]:
# 국어점수, 수학점수를 더한 총합 컬럼 만들기
df['점수총합'] = df['국어점수'] + df['수학점수']
df['평균'] = df['점수총합'] / 2 # 브로드캐스팅
df['결과'] = '불합격'

     이름   지역   나이  국어점수  수학점수          코딩  점수총합    평균   결과
번호
1번  유재석   경기  19세    86    86      python   172  86.0  불합격
2번  박명수   대구  23세    90   100        java   190  95.0  불합격
3번  정준하  NaN  20세    80    66         NaN   146  73.0  불합격
4번  노홍철   경기  25세    65    70  javascript   135  67.5  불합격
5번  정형돈   경기  18세    50    40      python    90  45.0  불합격
6번   하하   경기  21세    60    80         NaN   140  70.0  불합격

In [81]:
# 총합 160 넘으면 합격
df.loc[df['점수총합'] > 160, '결과'] = '합격'
df

     이름   지역   나이  국어점수  수학점수          코딩  점수총합    평균   결과
번호
1번  유재석   경기  19세    86    86      python   172  86.0   합격
2번  박명수   대구  23세    90   100        java   190  95.0   합격
3번  정준하  NaN  20세    80    66         NaN   146  73.0  불합격
4번  노홍철   경기  25세    65    70  javascript   135  67.5  불합격
5번  정형돈   경기  18세    50    40      python    90  45.0  불합격
6번   하하   경기  21세    60    80         NaN   140  70.0  불합격

In [82]:
# 컬럼 삭제
df.drop(columns=['점수총합'], inplace=True)
df

     이름   지역   나이  국어점수  수학점수          코딩    평균   결과
번호
1번  유재석   경기  19세    86    86      python  86.0   합격
2번  박명수   대구  23세    90   100        java  95.0   합격
3번  정준하  NaN  20세    80    66         NaN  73.0  불합격
4번  노홍철   경기  25세    65    70  javascript  67.5  불합격
5번  정형돈   경기  18세    50    40      python  45.0  불합격
6번   하하   경기  21세    60    80         NaN  70.0  불합격

In [85]:
# Row 추가
df.loc['7번'] = ['길', '부산', 22, 90, 90, 'Kotlin']
df

     이름   지역  나이  국어점수  수학점수          코딩
번호
1번  유재석   서울  19    86    86      Python
2번  박명수   부산  23    90   100        Java
3번  정준하  NaN  20    80    66         NaN
4번  노홍철   서울  25    65    70  Javascript
5번  정형돈   서울  18    50    40      PYTHON
6번   하하   서울  21    60    80         NaN
7번    길   부산  22    90    90      Kotlin

In [89]:
# 셀 수정
df.loc['4번', '국어점수'] = 100
df

     이름   지역  나이  국어점수  수학점수      코딩
번호
1번  유재석   서울  19    86    86  Python
2번  박명수   부산  23    90   100    Java
3번  정준하  NaN  20    80    66     NaN
4번  노홍철   대구  25   100    70       C
5번  정형돈   서울  18    50    40  PYTHON
6번   하하   서울  21    60    80     NaN
7번    길   부산  22    90    90  Kotlin

In [90]:
# 특정 여러 셀 수정
df.loc['4번', ['지역', '코딩']] = ['대구', 'C']
df

     이름   지역  나이  국어점수  수학점수      코딩
번호
1번  유재석   서울  19    86    86  Python
2번  박명수   부산  23    90   100    Java
3번  정준하  NaN  20    80    66     NaN
4번  노홍철   대구  25   100    70       C
5번  정형돈   서울  18    50    40  PYTHON
6번   하하   서울  21    60    80     NaN
7번    길   부산  22    90    90  Kotlin